# Pandas

In [4]:
import pandas as pd

### Reading excel sheet

In [5]:
iris1=pd.read_excel("Iris_data_sample.xlsx", sheet_name="Iris_data")

In [6]:
iris1

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,NaN,1.4,0.2,NaN
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,??,3.1,1.5,0.2,Iris-setosa
4,5,5,3.6,###,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [11]:
iris1=pd.read_excel("Iris_data_sample.xlsx", sheet_name="Iris_data" , index_col=0) #reading first colun as index column

In [12]:
iris1.head()

  SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm      Species
1           5.1           3.5           1.4           0.2  Iris-setosa
2           4.9           NaN           1.4           0.2          NaN
3           4.7           3.2           1.3           0.2  Iris-setosa
4            ??           3.1           1.5           0.2  Iris-setosa
5             5           3.6           ###           0.2  Iris-setosa

In [13]:
iris1.info()   #SepalLengthCm and PetalLengthCm have object datatype

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SepalLengthCm  150 non-null    object
 1   SepalWidthCm   149 non-null    float64
 2   PetalLengthCm  149 non-null    object
 3   PetalWidthCm   150 non-null    float64
 4   Species        149 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.0+ KB

In [14]:
iris1=pd.read_excel("Iris_data_sample.xlsx", sheet_name="Iris_data" , index_col=0,
                   na_values=['??','###']) #consider ?? and ### as null values

In [15]:
iris1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SepalLengthCm  149 non-null    float64
 1   SepalWidthCm   149 non-null    float64
 2   PetalLengthCm  148 non-null    float64
 3   PetalWidthCm   150 non-null    float64
 4   Species        149 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [17]:
iris1.head()

   SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
1            5.1           3.5            1.4           0.2  Iris-setosa
2            4.9           NaN            1.4           0.2          NaN
3            4.7           3.2            1.3           0.2  Iris-setosa
4            NaN           3.1            1.5           0.2  Iris-setosa
5            5.0           3.6            NaN           0.2  Iris-setosa

In [20]:
iristxt=pd.read_table("iris.txt", delimiter=" ", usecols=["SepalLengthCm","SepalWidthCm",
                      "PetalLengthCm","PetalWidthCm","Species"])

In [21]:
iristxt

     SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm         Species
1              5.1           3.5            1.4           0.2     Iris-setosa
2              4.9           3.0            1.4           0.2     Iris-setosa
3              4.7           3.2            1.3           0.2     Iris-setosa
4              4.6           3.1            1.5           0.2     Iris-setosa
5              5.0           3.6            1.4           0.2     Iris-setosa
..             ...           ...            ...           ...             ...
146            6.7           3.0            5.2           2.3  Iris-virginica
147            6.3           2.5            5.0           1.9  Iris-virginica
148            6.5           3.0            5.2           2.0  Iris-virginica
149            6.2           3.4            5.4           2.3  Iris-virginica
150            5.9           3.0            5.1           1.8  Iris-virginica

[150 rows x 5 columns]

### Creating copy of data:


+ **Shallow copy:** : It is a copy of data but it still holds reference to original data.
                    : Means any changes made on shallow copy would reflect back on original copy of data
                    
+ **Deep copy:** : Copy of data without any reference to original data.
                 : By default deep/full copy

In [32]:
#Shallow copy:


cars_shallow=cars.copy(deep=False)

In [33]:
#Deep/Full copy:


cars_deep=cars.copy(deep=True)

### Other Pandas functions

In [27]:
cars=pd.read_csv("Toyota.csv", index_col=0)

In [28]:
cars.shape

(1436, 10)

In [29]:
cars.head(3)

   Price   Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel  90       NaN          0  2000      3    1165

In [30]:
cars.tail(3)

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [31]:
cars.sample(5)

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1249,7250,NaN,78689,Petrol,110,0.0,0,1600,4,1035
117,17900,NaN,1,Petrol,110,1.0,0,1600,3,1105
108,17950,20.0,7187,Petrol,110,1.0,0,1600,3,1105
1316,7450,75.0,67451,Petrol,86,1.0,0,1300,4,1000
1362,8250,70.0,59017,Petrol,107,1.0,1,1600,3,1080

In [35]:
cars.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
           dtype='int64', length=1436)

In [36]:
cars.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [37]:
cars.size #Total rows

14360

In [39]:
cars.memory_usage()   #Total bytes occupied by each column

Index        11488
Price        11488
Age          11488
KM           11488
FuelType     11488
HP           11488
MetColor     11488
Automatic    11488
CC           11488
Doors        11488
Weight       11488
dtype: int64

In [40]:
cars.memory_usage(index=True, deep=True)   #calculating memory for each element for object datatype

Index        11488
Price        11488
Age          11488
KM           89165
FuelType     87323
HP           85609
MetColor     11488
Automatic    11488
CC           11488
Doors        83298
Weight       11488
dtype: int64

In [41]:
cars.ndim

2

### Indexing and slicing

- [] : using subscript operator

+ **2 Methods**:
    - Label based: 'at' method
    - Integer based: 'iat' (index at) method
    - location based: 'loc' method

In [42]:
cars.at[80,"FuelType"]   #will give 80th value in column 'FuelType'

'Petrol'

In [44]:
cars.iat[80,3]   #will give 80th value in 3rd column 'FuelType'

'Petrol'

In [45]:
cars.loc[:,'FuelType']

0       Diesel
1       Diesel
2       Diesel
3       Diesel
4       Diesel
         ...
1431    Petrol
1432    Petrol
1433    Petrol
1434       NaN
1435    Petrol
Name: FuelType, Length: 1436, dtype: object

In [47]:
cars.loc[:,["FuelType","KM"]]

     FuelType     KM
0      Diesel  46986
1      Diesel  72937
2      Diesel  41711
3      Diesel  48000
4      Diesel  38500
...       ...    ...
1431   Petrol  20544
1432   Petrol     ??
1433   Petrol  17016
1434      NaN     ??
1435   Petrol      1

[1436 rows x 2 columns]

In [48]:
cars.dtypes

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

### Difference between category and object

- Memory require for C is less than that of O

In [49]:
print(cars.dtypes.astype(str).value_counts())

object     4
int64      4
float64    2
dtype: int64

In [51]:
cars.select_dtypes(exclude=[object])

      Price   Age  MetColor  Automatic    CC  Weight
0     13500  23.0       1.0          0  2000    1165
1     13750  23.0       1.0          0  2000    1165
2     13950  24.0       NaN          0  2000    1165
3     14950  26.0       0.0          0  2000    1165
4     13750  30.0       0.0          0  2000    1170
...     ...   ...       ...        ...   ...     ...
1431   7500   NaN       1.0          0  1300    1025
1432  10845  72.0       0.0          0  1300    1015
1433   8500   NaN       0.0          0  1300    1015
1434   7250  70.0       1.0          0  1300    1015
1435   6950  76.0       0.0          0  1600    1114

[1436 rows x 6 columns]

In [53]:
cars.select_dtypes(float)

       Age  MetColor
0     23.0       1.0
1     23.0       1.0
2     24.0       NaN
3     26.0       0.0
4     30.0       0.0
...    ...       ...
1431   NaN       1.0
1432  72.0       0.0
1433   NaN       0.0
1434  70.0       1.0
1435  76.0       0.0

[1436 rows x 2 columns]

In [54]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 163.4+ KB

## Cleaning needed to be done:

- KM : read as Object instead int/fload
- HP : read as Object instead int
- MetColor & Automatic : read as int/float instead categorical
- Doors : read as object instead int
- Flueltype : read as object, and we'll convert it to category

- Need to treat missing values as well

In [71]:
# Dealing with KM and HP columns

In [57]:
import numpy as np

np.unique(cars['KM'])

array(['1', '10000', '100123', ..., '99865', '99971', '??'], dtype=object)

In [58]:
np.unique(cars['HP'])

array(['107', '110', '116', '192', '69', '71', '72', '73', '86', '90',
       '97', '98', '????'], dtype=object)

In [59]:
np.unique(cars['MetColor'])

array([ 0.,  1., nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan])

In [60]:
np.unique(cars['Automatic'])

array([0, 1], dtype=int64)

In [61]:
np.unique(cars['Doors'])

array(['2', '3', '4', '5', 'five', 'four', 'three'], dtype=object)

#### Replacing special characters with nan

In [142]:
cars=pd.read_csv("Toyota.csv", index_col=0, na_values=['??','????'])

In [63]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

In [67]:
# FuelType : read as object, and we'll convert it to category

In [69]:
cars['FuelType'].nbytes

11488

In [70]:
cars['FuelType'].astype('category').nbytes

1460

In [72]:
# We'll use 'Replace' function to deal with Door column

In [73]:
np.unique(cars["Doors"])

array(['2', '3', '4', '5', 'five', 'four', 'three'], dtype=object)

In [80]:
cars["Doors"].replace("three",3, inplace=True)

In [81]:
cars["Doors"].replace("four",4, inplace=True)

In [82]:
cars["Doors"].replace("five",5, inplace=True)

In [83]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

In [84]:
cars['Doors'].unique()  #It will still remain in object type, so we need to use astype(int)

array([3, '3', '5', '4', 4, 5, '2'], dtype=object)

In [90]:
cars['Doors']=cars['Doors'].astype("int64")

In [91]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   int64
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(5), object(1)
memory usage: 123.4+ KB

In [92]:
cars['Doors'].nbytes

11488

In [93]:
# Dealing with null values

In [94]:
cars.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

#### Experimenting on new column

In [99]:
cars.insert(10,"Price_Class", "")

In [100]:
cars.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_Class
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,three,1165,
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,

In [101]:
# Low -> Upto 8450
# Medium -> 8450 - 11950
# High -> > 11950

In [107]:
for i in range(0,len(cars['Price'])):
    if cars['Price'][i]<=8450:
        cars['Price_Class'][i]="Low"
    elif cars['Price'][i]>11950:
        cars['Price_Class'][i]="High"
    else:
        cars['Price_Class'][i]="Medium"

D:\Anaconda\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
D:\Anaconda\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
D:\Anaconda\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [108]:
cars.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_Class
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,three,1165,High
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High

In [114]:
cars['Price_Class'].value_counts()

Medium    751
Low       369
High      316
Name: Price_Class, dtype: int64

In [109]:
# Converting Age into years

In [110]:
cars.insert(11,"Age_Converted",0)

In [111]:
cars.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_Class,Age_Converted
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,three,1165,High,0
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High,0
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,0
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High,0
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High,0

In [112]:
def convert_val(val):
    conv_value=val/12
    return conv_value

In [113]:
convert_val(20)

1.6666666666666667

In [118]:
cars['Age_Converted']=convert_val(cars['Age'])                       # We are using 'Age' column to convert it in years and 
                                                                     #put it in Age_converted column

In [119]:
cars.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_Class,Age_Converted
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,three,1165,High,1.916667
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High,1.916667
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,2.000000
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High,2.166667
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High,2.500000

In [134]:
cars['Age_Converted']=round(cars['Age_Converted'],2)

In [135]:
cars.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_Class,Age_Converted
0,13500,NaN,46986.0,Diesel,90.0,1.0,0,2000,three,1165,High,1.92
1,13750,NaN,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High,1.92
2,13950,NaN,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,2.00
3,14950,NaN,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High,2.17
4,13750,NaN,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High,2.50

In [136]:
#Missing values:

In [137]:
missing=cars[cars.isnull().any(axis=1)]

In [138]:
missing

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_Class,Age_Converted
0,13500,NaN,46986.0,Diesel,90.0,1.0,0,2000,three,1165,High,1.92
1,13750,NaN,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High,1.92
2,13950,NaN,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,2.00
3,14950,NaN,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High,2.17
4,13750,NaN,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High,2.50
...,...,...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86.0,1.0,0,1300,3,1025,Low,NaN
1432,10845,NaN,NaN,Petrol,86.0,0.0,0,1300,3,1015,Medium,6.00
1433,8500,NaN,17016.0,Petrol,86.0,0.0,0,1300,3,1015,Medium,NaN
1434,7250,NaN,NaN,NaN,86.0,1.0,0,1300,3,1015,Low,5.83
1435,6950,NaN,1.0,Petrol,110.0,0.0,0,1600,5,1114,Low,6.33

In [143]:
cars.describe().T

,count,mean,std,min,25%,50%,75%,max
Price,1436.0,10730.824513,3626.964585,4350.0,8450.0,9900.0,11950.0,32500.0
Age,1336.0,55.672156,18.589804,1.0,43.0,60.0,70.0,80.0
KM,1421.0,68647.239972,37333.023589,1.0,43210.0,63634.0,87000.0,243000.0
HP,1430.0,101.478322,14.768255,69.0,90.0,110.0,110.0,192.0
MetColor,1286.0,0.674961,0.468572,0.0,0.0,1.0,1.0,1.0
Automatic,1436.0,0.055710,0.229441,0.0,0.0,0.0,0.0,1.0
CC,1436.0,1566.827994,187.182436,1300.0,1400.0,1600.0,1600.0,2000.0
Weight,1436.0,1072.459610,52.641120,1000.0,1040.0,1070.0,1085.0,1615.0

In [144]:
cars['Age']=55.672156

In [145]:
cars['Age'].fillna(cars['Age'].mean(),inplace=True)

In [146]:
cars.isnull().sum()

Price          0
Age            0
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [147]:
cars["KM"].fillna(cars["KM"].median(), inplace=True)

In [148]:
cars["HP"].fillna(cars["HP"].mean(), inplace=True)

In [149]:
cars.isnull().sum()

Price          0
Age            0
KM             0
FuelType     100
HP             0
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [153]:
cars["FuelType"].value_counts()

Petrol    1277
Diesel     144
CNG         15
Name: FuelType, dtype: int64

In [151]:
cars["FuelType"].fillna(cars["FuelType"].value_counts().index[0], inplace=True)

In [154]:
cars.isnull().sum()

Price          0
Age            0
KM             0
FuelType       0
HP             0
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [155]:
cars['MetColor'].value_counts()

1.0    868
0.0    418
Name: MetColor, dtype: int64

In [156]:
cars["MetColor"].fillna(cars["MetColor"].value_counts().index[0], inplace=True)

In [157]:
cars.isnull().sum()

Price        0
Age          0
KM           0
FuelType     0
HP           0
MetColor     0
Automatic    0
CC           0
Doors        0
Weight       0
dtype: int64

# Groupby

In [158]:
cars

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,55.672156,46986.0,Diesel,90.0,1.0,0,2000,three,1165
1,13750,55.672156,72937.0,Diesel,90.0,1.0,0,2000,3,1165
2,13950,55.672156,41711.0,Diesel,90.0,1.0,0,2000,3,1165
3,14950,55.672156,48000.0,Diesel,90.0,0.0,0,2000,3,1165
4,13750,55.672156,38500.0,Diesel,90.0,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,55.672156,20544.0,Petrol,86.0,1.0,0,1300,3,1025
1432,10845,55.672156,63634.0,Petrol,86.0,0.0,0,1300,3,1015
1433,8500,55.672156,17016.0,Petrol,86.0,0.0,0,1300,3,1015
1434,7250,55.672156,63634.0,Petrol,86.0,1.0,0,1300,3,1015
1435,6950,55.672156,1.0,Petrol,110.0,0.0,0,1600,5,1114

In [160]:
group=cars.groupby('FuelType')

In [161]:
group.describe().T

FuelType              CNG        Diesel        Petrol
Price  count    15.000000    144.000000   1277.000000
       mean   9584.000000  10889.277778  10726.427565
       std    2616.783194   5179.446281   3419.677812
       min    5250.000000   4350.000000   5250.000000
       25%    7850.000000   7500.000000   8500.000000
...                   ...           ...           ...
Weight min    1067.000000   1095.000000   1000.000000
       25%    1081.000000   1115.000000   1035.000000
       50%    1103.000000   1135.000000   1060.000000
       75%    1119.000000   1161.250000   1075.000000
       max    1121.000000   1480.000000   1615.000000

[64 rows x 3 columns]